[Exclure les lignes différentes par formule Python](https://www.youtube.com/watch?v=u31xzznINxg&list=PLpQBnWleLAauKmgcdndmEr81iIIoW9_Wi&index=16)

Date : 21/05/2025

In [1]:
import pandas as pd

In [2]:
tab1 = pd.read_excel('data/Merge.xlsx', sheet_name='Feuil1')

In [3]:
tab1.head()

             Nom    Prénom
0        Bonbeur      Jean
1        Hèresse    Mégane
2           Noix  Stéphane
3         Gature    Emilie
4  De MontéCarlo   Coralie

In [4]:
tab2 = pd.read_excel('data/Merge.xlsx', sheet_name='Feuil2')

In [5]:
tab2.head()

             Nom    Prénom
0        Bonbeur      Jean
1        Hèresse    Mégane
2           Noix  Stéphane
3         Gature    Emilie
4  De MontéCarlo   Coralie

In [14]:
# Récupération des lignes avec indication si présent dans les deux tables...
fusion = tab1.merge(tab2, on=['Nom', 'Prénom'], how='outer', indicator=True)
fusion

              Nom    Prénom      _merge
0         Bonbeur      Jean        both
1         Braltar     Giles        both
2   De MontéCarlo   Coralie        both
3           Doeuf      John        both
4          Douche      Raël        both
5         Feuille    Emille  right_only
6         Fortune     Alain  right_only
7          Gature    Emilie        both
8         Honnête   Camille   left_only
9         Hèresse    Mégane        both
10         Hénéré    Nadège        both
11            Jet    Claire        both
12           Lile   Maurice        both
13          Louya       Ali  right_only
14         Niomme    Gérard        both
15           Noix  Stéphane        both
16       Ocerosse  Séverine  right_only
17       Sansasse    Lionel   left_only
18       Sarbaque      Anne        both
19           Solo     Yohan        both
20          Thine     Nikos   left_only
21        Tomette     Jerry   left_only

In [16]:
# Affichage des lignes qui ne sont pas présentes dans les deux tables
diff = fusion[fusion['_merge'].isin(['left_only', 'right_only'])].drop(
    columns=['_merge']).reset_index(drop=True)
diff

        Nom    Prénom
0   Feuille    Emille
1   Fortune     Alain
2   Honnête   Camille
3     Louya       Ali
4  Ocerosse  Séverine
5  Sansasse    Lionel
6     Thine     Nikos
7   Tomette     Jerry